lisyaoran51/M0516_Test/AllPanelFunction/main.c
				}
				else if(i == 9 || i ==11 || i == 13){	// press second pad
						if(GetPin(0, j) == 0){
								pressedNum = (i-8)/2*8+j;
								if(pressedKey[pressedNum] == 1){
										//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
										printf("press [%d] %d %d with speed %ds\n", pressedNum, i, j, timerCount - pressedKeyTime[pressedNum]);
										pressedKey[pressedNum] = 2;
									
								}
								//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
						}
				}
				else{
					
					if(GetPin(0, j) == 0){
							if(i ==14 && (j == 4 || j == 5)){
									switch(sectionKnobState){
									case 0:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) != 0){
													sectionKnobState = 1;
													printf("section knob forward.\n");
											}
											else if(GetPin(0, 5) == 0 && GetPin(0, 4) != 0){
													sectionKnobState = 2;
													printf("section knob backward.\n");
											}
											break;
									case 1:
									case 2:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) == 0){
													sectionKnobState = 0;
													printf("section knob floating.\n");
											}
											break;
									}
							}
							else{
									if(i == 14){
											switch(j){
											case 1:
													if(sensitiveButton != 1){
															sensitiveButton = 1;
															printf("Press Sensitive button.\n");
													}
													break;
											case 2:
													if(sustainButton != 1){
															sustainButton = 1;
															printf("Press Sustain button.\n");
													}
													break;
											case 3:
													if(speedButton != 1){
															speedButton = 1;
															printf("Press Speed button.\n");
													}
													break;
													
												
											}
										
									}
									else if(i ==15){
											switch(j){
											case 0:
													if(pauseButton != 1){
															pauseButton = 1;
															printf("Press Pause button.\n");
													}
													break;
											case 1:
													if(raiseOctaceButton != 1){
															raiseOctaceButton = 1;
															printf("Press Raise octave button.\n");
													}
													break;
											case 2:
													if(lowerOctaceButton != 1){
															lowerOctaceButton = 1;
															printf("Press Lower octave button.\n");
													}
													break;
											case 3:
													if(pedalDown != 1){
															pedalDown = 1;
															printf("Pedal Down.\n");
													}
													break;
											case 4:
													printf("Speed knob forward.\n");
													break;
											case 5:
													printf("Speed knob backward.\n");
													break;
													
												
											}
									}
								
								
									//printf("read input i:%d j:%d at %ds\n",i, j, timerCount);
							}
							// lower octave: i=15, j=2
							// raise octave: i=15, j=1
							// left button(velocity): i=14, j=2
							// right button(sustain): i=14, j=1
							// pause: i=15, j=0
							// speed button: i=14, j=3
							// speed forward(clockwise): i=15, j=4
							// speed backward(counterclockwise): i=15, j=5
							// section forward(clockwise): i=14, j=4&5 (->) i=14, j=4 (->) i=14, j=4&5
							// section backward(counterclockwise): i=14, j=4&5 (->) i=14, j=5 (->) i=14, j=4&5
							// pedal: i=15, j=3
					}
					else{
							if(i == 14){
									switch(j){
									case 1:
											if(sensitiveButton == 1){
													sensitiveButton = 0;
													printf("Release Sensitive button.\n");
											}
											break;
									case 2:
											if(sustainButton == 1){
													sustainButton = 0;
													printf("Release Sustain button.\n");
											}
											break;
									case 3:
											if(speedButton == 1){
													speedButton = 0;
													printf("Release Speed button.\n");
											}
											break;
									}
							}
							else if(i ==15){
									switch(j){
									case 0:
											if(pauseButton == 1){
													pauseButton = 0;
													printf("Release Pause button.\n");
											}
											break;
									case 1:
											if(raiseOctaceButton == 1){
													raiseOctaceButton = 0;
													printf("Release Raise octave button.\n");
											}
											break;
									case 2:
											if(lowerOctaceButton == 1){
													lowerOctaceButton = 0;
													printf("Release Lower octave button.\n");
											}
											break;
									case 3:
											if(pedalDown == 1){
													pedalDown = 0;
													printf("Pedal Up.\n");
											}
											break;
									}
							}
					}
				}
			}
		}
		
		//printf("power:%d pedal:%d\n", P40, P13);
		
}

void SetIndicatorLights(int lightNumber, int on){
		
		
		// 0: power
		// 1: sentivity
		// 2: sustain
		// 3: raise octave
		//    *13
		// *8    *12
		// *9    *11
		//    *10
		// 14: lower octave
	
		uint8_t i, j;
		// https://ddddiy.blogspot.com/2014/02/74hct595n.html
		if(on == 1)
			indicatorLights[lightNumber] = 1;
		else if(on == 0)
			indicatorLights[lightNumber] = 0;
	
	
		for(i = 0; i < 16; i++){
				LatchPin = 0;
				for(j = 15; j < 16; j--){
						ClockPin = 0;
						
						if(indicatorLights[j] == 1)
							DataPin = 1;
						else
							DataPin = 0;
						
						ClockPin = 1;
				}
				LatchPin = 1;
			
		}
}

/*
 * position: 0~8
 */
void SetPwmLightRing(int position){
	
		//				*B3
		//		*A0			*B2
		//	*A1					*B1
		//		*A2			*B0
		//				*A3
		
		uint16_t brightnessArray[8] = {0};
		uint16_t i;
		
		for(i = 0;i < 8; i++){
				if(i > position)
					brightnessArray[i] = 0x0;
				else if(i == position)
					brightnessArray[i] = 0xFF0;
				else
					brightnessArray[i] = 0x100;
		}
		
		PWMA->CMR0 = brightnessArray[7];
		PWMA->CMR1 = brightnessArray[6];
		PWMA->CMR2 = brightnessArray[5];
		PWMA->CMR3 = brightnessArray[4];
								
		PWMB->CMR0 = brightnessArray[3];
		PWMB->CMR1 = brightnessArray[2];
		PWMB->CMR2 = brightnessArray[1];
		PWMB->CMR3 = brightnessArray[0];
}

/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    int32_t i32Err;
		int count = 0;
		int lightPos = 0;
		

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, peripheral clock and multi-function I/O */
    //I2C0_SYS_Init();
		SYS_Init();
		
